IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
<module name="MSS_RCM_MSS_RCM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MSS_RCM_PID" acronym="MSS_RCM_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_R5SS0_RST_STATUS" acronym="MSS_RCM_R5SS0_RST_STATUS" offset="0x10" width="16" description="">
		<bitfield id="CAUSE" width="11" begin="10" end="0" resetval="0x3" description="Has the status because of which reset has happened.  Bit0: POR ResetBit1: Warm Reset (ALso set during POR Reset)Bit2: CR5SS0 STC ResetBit3  Reset for CORE0 and MSS_CORE00_VIM  using MSS_RCM::MSS_CR5SSA0_RST_CTRLBit4: Reset for CORE1 and MSS_CORE10_VIM using MSS_RCM::MSS_CR5SSB0_RST_CTRLBit5: Reset for  CORE0 only using  MSS_RCM::MSS_CORE00_RST_CTRLBit6: Reset for CORE1 only using using MSS_RCM::MSS_CORE10_RST_CTRLBit7: Reset for CORE0 and MSS_CORE00_VIM caused because of reset request  by debugger in CORE00                                                                                                       Bit8:  Reset for CORE10 and MSS_CORE10_VIM caused because of reset request  by debugger in CORE10Bit9: Reset for CR5SS0 by the RESET FSM  using MSS_CTRL::R5SS0_CONTROL_RESET_FSM_TRIGGER        Bit 10 : MSS_RCM.MSS_CR5SS_POR_RST_CTRL0" range="10 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_R5SS0_RST_CAUSE_CLR" acronym="MSS_RCM_R5SS0_RST_CAUSE_CLR" offset="0x14" width="8" description="">
		<bitfield id="CLR" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field:Clear bit for rst cause register (writing '111'  will clear the rst cause register)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_DBG_RST_EN" acronym="MSS_RCM_R5SS0_DBG_RST_EN" offset="0x18" width="24" description="">
		<bitfield id="EN_CORE1" width="3" begin="18" end="16" resetval="0x0" description="writing '111'   will block debug reset request from CORE1  toggling reset for CORE1 of respective R5SS" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="EN_CORE0" width="3" begin="2" end="0" resetval="0x0" description="writing '111'   will block debug reset request from CORE0  toggling reset for CORE0 of respective R5SS" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_RST_ASSERDLY" acronym="MSS_RCM_R5SS0_RST_ASSERDLY" offset="0x1C" width="8" description="">
		<bitfield id="COUNT" width="8" begin="7" end="0" resetval="0x15" description="Value decides number of cycles reset should be kept asserted for CR5SS related resets. Programming a value of 0xFF will keep the reset asserted untill a new value other than 0xFF is written to this registerThe actual duration is count + 2 cycles. S/W Recommended value for this is 0x0FThe COUNT is applicable to both CPU cores" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_RST2ASSERTDLY" acronym="MSS_RCM_R5SS0_RST2ASSERTDLY" offset="0x20" width="32" description="">
		<bitfield id="R5_CORE1_COUNT" width="8" begin="31" end="24" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE1" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="R5_CORE0_COUNT" width="8" begin="23" end="16" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE0." range="23 - 16" rwaccess="RW"/> 
		<bitfield id="R5SS_CORE1_COUNT" width="8" begin="15" end="8" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE1" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="R5SS_CORE0_COUNT" width="8" begin="7" end="0" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE0." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_RST_WFICHECK" acronym="MSS_RCM_R5SS0_RST_WFICHECK" offset="0x24" width="32" description="">
		<bitfield id="EN_R5_CORE1" width="3" begin="26" end="24" resetval="0x7" description="writing '000' will disable check for WFI before  local reset assertion of CORE0" range="26 - 24" rwaccess="RW"/> 
		<bitfield id="EN_R5_CORE0" width="3" begin="18" end="16" resetval="0x7" description="writing '000' will disable check for WFI before  local reset assertion of CORE0" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="EN_R5SS_CORE1" width="3" begin="10" end="8" resetval="0x7" description="writing '000' will disable check for WFI before  global reset assertion of CORE1" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="EN_R5SS_CORE0" width="3" begin="2" end="0" resetval="0x7" description="writing '000' will disable check for WFI before  global reset assertion of CORE0" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_RST_STATUS" acronym="MSS_RCM_R5SS1_RST_STATUS" offset="0x30" width="16" description="">
		<bitfield id="CAUSE" width="11" begin="10" end="0" resetval="0x3" description="Has the status because of which reset has happened.  Bit0: POR ResetBit1: Warm Reset (ALso set during POR Reset)Bit2: CR5SS1 STC ResetBit3  Reset for CORE0 and MSS_CORE00_VIM  using MSS_RCM::MSS_CR5SSA0_RST_CTRLBit4: Reset for CORE1 and MSS_CORE10_VIM using MSS_RCM::MSS_CR5SSB0_RST_CTRLBit5: Reset for  CORE0 only using  MSS_RCM::MSS_CORE00_RST_CTRLBit6: Reset for CORE1 only using using MSS_RCM::MSS_CORE10_RST_CTRLBit7: Reset for CORE0 and MSS_CORE00_VIM caused because of reset request  by debugger in CORE00                                                                                                       Bit8:  Reset for CORE10 and MSS_CORE10_VIM caused because of reset request  by debugger in CORE10Bit9: Reset for CR5SS0 by the RESET FSM  using MSS_CTRL::R5SS0_CONTROL_RESET_FSM_TRIGGER        Bit 10 : MSS_RCM.MSS_CR5SS_POR_RST_CTRL0" range="10 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_R5SS1_RST_CAUSE_CLR" acronym="MSS_RCM_R5SS1_RST_CAUSE_CLR" offset="0x34" width="8" description="">
		<bitfield id="CLR" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field:Clear bit for rst cause register (writing '111'  will clear the rst cause register)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_DBG_RST_EN" acronym="MSS_RCM_R5SS1_DBG_RST_EN" offset="0x38" width="24" description="">
		<bitfield id="EN_CORE1" width="3" begin="18" end="16" resetval="0x0" description="writing '111'   will block debug reset request from CORE1  toggling reset for CORE1 of respective R5SS" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="EN_CORE0" width="3" begin="2" end="0" resetval="0x0" description="writing '111'   will block debug reset request from CORE0  toggling reset for CORE0 of respective R5SS" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_RST_ASSERDLY" acronym="MSS_RCM_R5SS1_RST_ASSERDLY" offset="0x3C" width="8" description="">
		<bitfield id="COUNT" width="8" begin="7" end="0" resetval="0x15" description="Value decides number of cycles reset should be kept asserted for CR5SS related resets. Programming a value of 0xFF will keep the reset asserted untill a new value other than 0xFF is written to this registerThe actual duration is count + 2 cycles. S/W Recommended value for this is 0x0FThe COUNT is applicable to both CPU cores" range="7 - 0" rwaccess="RW"/>
	</register>
