IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_R5SS1_RST2ASSERTDLY" acronym="MSS_RCM_R5SS1_RST2ASSERTDLY" offset="0x40" width="32" description="">
		<bitfield id="R5_CORE1_COUNT" width="8" begin="31" end="24" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE1" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="R5_CORE0_COUNT" width="8" begin="23" end="16" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for local reset for CORE0." range="23 - 16" rwaccess="RW"/> 
		<bitfield id="R5SS_CORE1_COUNT" width="8" begin="15" end="8" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE1" range="15 - 8" rwaccess="RW"/> 
		<bitfield id="R5SS_CORE0_COUNT" width="8" begin="7" end="0" resetval="0x0" description="Value decides number of cycles to wait before asserting reset for global reset for CORE0." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_RST_WFICHECK" acronym="MSS_RCM_R5SS1_RST_WFICHECK" offset="0x44" width="32" description="">
		<bitfield id="EN_R5_CORE1" width="3" begin="26" end="24" resetval="0x7" description="writing '000' will disable check for WFI before  local reset assertion of CORE0" range="26 - 24" rwaccess="RW"/> 
		<bitfield id="EN_R5_CORE0" width="3" begin="18" end="16" resetval="0x7" description="writing '000' will disable check for WFI before  local reset assertion of CORE0" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="EN_R5SS_CORE1" width="3" begin="10" end="8" resetval="0x7" description="writing '000' will disable check for WFI before  global reset assertion of CORE1" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="EN_R5SS_CORE0" width="3" begin="2" end="0" resetval="0x7" description="writing '000' will disable check for WFI before  global reset assertion of CORE0" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN0_CLK_SRC_SEL" acronym="MSS_RCM_MCAN0_CLK_SRC_SEL" offset="0x100" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN1_CLK_SRC_SEL" acronym="MSS_RCM_MCAN1_CLK_SRC_SEL" offset="0x104" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN2_CLK_SRC_SEL" acronym="MSS_RCM_MCAN2_CLK_SRC_SEL" offset="0x108" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN3_CLK_SRC_SEL" acronym="MSS_RCM_MCAN3_CLK_SRC_SEL" offset="0x10C" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding MCAN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_QSPI0_CLK_SRC_SEL" acronym="MSS_RCM_QSPI0_CLK_SRC_SEL" offset="0x110" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for QSPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI0_CLK_SRC_SEL" acronym="MSS_RCM_RTI0_CLK_SRC_SEL" offset="0x114" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI1_CLK_SRC_SEL" acronym="MSS_RCM_RTI1_CLK_SRC_SEL" offset="0x118" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI2_CLK_SRC_SEL" acronym="MSS_RCM_RTI2_CLK_SRC_SEL" offset="0x11C" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI3_CLK_SRC_SEL" acronym="MSS_RCM_RTI3_CLK_SRC_SEL" offset="0x120" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT0_CLK_SRC_SEL" acronym="MSS_RCM_WDT0_CLK_SRC_SEL" offset="0x128" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
