IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_WDT1_CLK_SRC_SEL" acronym="MSS_RCM_WDT1_CLK_SRC_SEL" offset="0x12C" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT2_CLK_SRC_SEL" acronym="MSS_RCM_WDT2_CLK_SRC_SEL" offset="0x130" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT3_CLK_SRC_SEL" acronym="MSS_RCM_WDT3_CLK_SRC_SEL" offset="0x134" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI0_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI0_CLK_SRC_SEL" offset="0x13C" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI1_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI1_CLK_SRC_SEL" offset="0x140" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI2_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI2_CLK_SRC_SEL" offset="0x144" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI3_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI3_CLK_SRC_SEL" offset="0x148" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI4_CLK_SRC_SEL" acronym="MSS_RCM_MCSPI4_CLK_SRC_SEL" offset="0x14C" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for Corresponding SPI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MMC0_CLK_SRC_SEL" acronym="MSS_RCM_MMC0_CLK_SRC_SEL" offset="0x150" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for MMCSD.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_ICSSM0_UART0_CLK_SRC_SEL" acronym="MSS_RCM_ICSSM0_UART0_CLK_SRC_SEL" offset="0x154" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for ICSSM_UCLK.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_CPTS_CLK_SRC_SEL" acronym="MSS_RCM_CPTS_CLK_SRC_SEL" offset="0x158" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for CPTS.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_GPMC_CLK_SRC_SEL" acronym="MSS_RCM_GPMC_CLK_SRC_SEL" offset="0x15C" width="16" description="">
		<bitfield id="GPMC_CLK_SRC_SEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for GPMC. Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_CONTROLSS_PLL_CLK_SRC_SEL" acronym="MSS_RCM_CONTROLSS_PLL_CLK_SRC_SEL" offset="0x160" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for CONTROLSS_PLL.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_I2C_CLK_SRC_SEL" acronym="MSS_RCM_I2C_CLK_SRC_SEL" offset="0x164" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for I2C.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN0_UART0_CLK_SRC_SEL" acronym="MSS_RCM_LIN0_UART0_CLK_SRC_SEL" offset="0x174" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN1_UART1_CLK_SRC_SEL" acronym="MSS_RCM_LIN1_UART1_CLK_SRC_SEL" offset="0x178" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN2_UART2_CLK_SRC_SEL" acronym="MSS_RCM_LIN2_UART2_CLK_SRC_SEL" offset="0x17C" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN3_UART3_CLK_SRC_SEL" acronym="MSS_RCM_LIN3_UART3_CLK_SRC_SEL" offset="0x180" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN4_UART4_CLK_SRC_SEL" acronym="MSS_RCM_LIN4_UART4_CLK_SRC_SEL" offset="0x184" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
