IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_LIN5_UART5_CLK_SRC_SEL" acronym="MSS_RCM_LIN5_UART5_CLK_SRC_SEL" offset="0x188" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for corresponding UART and LIN.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN0_CLK_DIV_VAL" acronym="MSS_RCM_MCAN0_CLK_DIV_VAL" offset="0x200" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.Data should be loaded as multibit.  For example: if divider value of 8(1000) should be selected then '100010001000' should be configured to the register.Refer to AM602 clock planner for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN1_CLK_DIV_VAL" acronym="MSS_RCM_MCAN1_CLK_DIV_VAL" offset="0x204" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.Data should be loaded as multibit.  For example: if divider value of 8(1000) should be selected then '100010001000' should be configured to the register.Refer to AM602 clock planner for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN2_CLK_DIV_VAL" acronym="MSS_RCM_MCAN2_CLK_DIV_VAL" offset="0x208" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.Data should be loaded as multibit.  For example: if divider value of 8(1000) should be selected then '100010001000' should be configured to the register.Refer to AM602 clock planner for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN3_CLK_DIV_VAL" acronym="MSS_RCM_MCAN3_CLK_DIV_VAL" offset="0x20C" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value corresponding MCAN selected clock.Data should be loaded as multibit.  For example: if divider value of 8(1000) should be selected then '100010001000' should be configured to the register.Refer to AM602 clock planner for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_QSPI0_CLK_DIV_VAL" acronym="MSS_RCM_QSPI0_CLK_DIV_VAL" offset="0x210" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value QSPI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI0_CLK_DIV_VAL" acronym="MSS_RCM_RTI0_CLK_DIV_VAL" offset="0x214" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI1_CLK_DIV_VAL" acronym="MSS_RCM_RTI1_CLK_DIV_VAL" offset="0x218" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI2_CLK_DIV_VAL" acronym="MSS_RCM_RTI2_CLK_DIV_VAL" offset="0x21C" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI3_CLK_DIV_VAL" acronym="MSS_RCM_RTI3_CLK_DIV_VAL" offset="0x220" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding RTI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT0_CLK_DIV_VAL" acronym="MSS_RCM_WDT0_CLK_DIV_VAL" offset="0x228" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT1_CLK_DIV_VAL" acronym="MSS_RCM_WDT1_CLK_DIV_VAL" offset="0x22C" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT2_CLK_DIV_VAL" acronym="MSS_RCM_WDT2_CLK_DIV_VAL" offset="0x230" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT3_CLK_DIV_VAL" acronym="MSS_RCM_WDT3_CLK_DIV_VAL" offset="0x234" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value WDT selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI0_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI0_CLK_DIV_VAL" offset="0x23C" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI1_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI1_CLK_DIV_VAL" offset="0x240" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI2_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI2_CLK_DIV_VAL" offset="0x244" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI3_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI3_CLK_DIV_VAL" offset="0x248" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI4_CLK_DIV_VAL" acronym="MSS_RCM_MCSPI4_CLK_DIV_VAL" offset="0x24C" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value Corresponding SPI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MMC0_CLK_DIV_VAL" acronym="MSS_RCM_MMC0_CLK_DIV_VAL" offset="0x250" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value MMCSD selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
