IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_ICSSM0_UART_CLK_DIV_VAL" acronym="MSS_RCM_ICSSM0_UART_CLK_DIV_VAL" offset="0x254" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value ICSSM_UCLK selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_CPTS_CLK_DIV_VAL" acronym="MSS_RCM_CPTS_CLK_DIV_VAL" offset="0x258" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value CPTS selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_GPMC_CLK_DIV_VAL" acronym="MSS_RCM_GPMC_CLK_DIV_VAL" offset="0x25C" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value GPMC selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_CONTROLSS_PLL_CLK_DIV_VAL" acronym="MSS_RCM_CONTROLSS_PLL_CLK_DIV_VAL" offset="0x260" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value CONTROLSS_PLL selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_I2C_CLK_DIV_VAL" acronym="MSS_RCM_I2C_CLK_DIV_VAL" offset="0x264" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value I2C selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN0_UART0_CLK_DIV_VAL" acronym="MSS_RCM_LIN0_UART0_CLK_DIV_VAL" offset="0x274" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN1_UART1_CLK_DIV_VAL" acronym="MSS_RCM_LIN1_UART1_CLK_DIV_VAL" offset="0x278" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN2_UART2_CLK_DIV_VAL" acronym="MSS_RCM_LIN2_UART2_CLK_DIV_VAL" offset="0x27C" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN3_UART3_CLK_DIV_VAL" acronym="MSS_RCM_LIN3_UART3_CLK_DIV_VAL" offset="0x280" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN4_UART4_CLK_DIV_VAL" acronym="MSS_RCM_LIN4_UART4_CLK_DIV_VAL" offset="0x284" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN5_UART5_CLK_DIV_VAL" acronym="MSS_RCM_LIN5_UART5_CLK_DIV_VAL" offset="0x288" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value for corresponding UART and LIN selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RGMII_250_CLK_DIV_VAL" acronym="MSS_RCM_RGMII_250_CLK_DIV_VAL" offset="0x28C" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x273" description="Divider value RGMII selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RGMII_50_CLK_DIV_VAL" acronym="MSS_RCM_RGMII_50_CLK_DIV_VAL" offset="0x290" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x2457" description="Divider value MII100 selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RGMII_5_CLK_DIV_VAL" acronym="MSS_RCM_RGMII_5_CLK_DIV_VAL" offset="0x294" width="24" description="">
		<bitfield id="CLKDIVR" width="24" begin="23" end="0" resetval="0x6513507" description="Divider value MII10 selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_XTAL_MMC_32K_CLK_DIV_VAL" acronym="MSS_RCM_XTAL_MMC_32K_CLK_DIV_VAL" offset="0x298" width="32" description="">
		<bitfield id="CLKDIVR" width="30" begin="29" end="0" resetval="0x818688780" description="Divider value for XTAL_32K clock.Data should be loaded as multibit.  For example: if divider value of '0x30C' is required then '0x30CC330C' should be configured to the register.Refer to AM602 clock spec for clock reference" range="29 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_XTAL_TEMPSENSE_32K_CLK_DIV_VAL" acronym="MSS_RCM_XTAL_TEMPSENSE_32K_CLK_DIV_VAL" offset="0x29C" width="32" description="">
		<bitfield id="CLKDIVR" width="30" begin="29" end="0" resetval="0x818688780" description="Divider value for XTAL_32K clock.Data should be loaded as multibit.  For example: if divider value of '0x30C' is required then '0x30CC330C' should be configured to the register.Refer to AM602 clock spec for clock reference" range="29 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MSS_ELM_CLK_DIV_VAL" acronym="MSS_RCM_MSS_ELM_CLK_DIV_VAL" offset="0x2A0" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x819" description="Divider value ELM clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN0_CLK_GATE" acronym="MSS_RCM_MCAN0_CLK_GATE" offset="0x300" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for corresponding MCAN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN1_CLK_GATE" acronym="MSS_RCM_MCAN1_CLK_GATE" offset="0x304" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for corresponding MCAN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN2_CLK_GATE" acronym="MSS_RCM_MCAN2_CLK_GATE" offset="0x308" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for corresponding MCAN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN3_CLK_GATE" acronym="MSS_RCM_MCAN3_CLK_GATE" offset="0x30C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for corresponding MCAN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_QSPI0_CLK_GATE" acronym="MSS_RCM_QSPI0_CLK_GATE" offset="0x310" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for QSPI" range="2 - 0" rwaccess="RW"/>
	</register>
