IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_RTI0_CLK_GATE" acronym="MSS_RCM_RTI0_CLK_GATE" offset="0x314" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for Corresponding RTI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI1_CLK_GATE" acronym="MSS_RCM_RTI1_CLK_GATE" offset="0x318" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for Corresponding RTI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI2_CLK_GATE" acronym="MSS_RCM_RTI2_CLK_GATE" offset="0x31C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for Corresponding RTI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI3_CLK_GATE" acronym="MSS_RCM_RTI3_CLK_GATE" offset="0x320" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for Corresponding RTI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT0_CLK_GATE" acronym="MSS_RCM_WDT0_CLK_GATE" offset="0x328" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for WDT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT1_CLK_GATE" acronym="MSS_RCM_WDT1_CLK_GATE" offset="0x32C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for WDT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT2_CLK_GATE" acronym="MSS_RCM_WDT2_CLK_GATE" offset="0x330" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for WDT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT3_CLK_GATE" acronym="MSS_RCM_WDT3_CLK_GATE" offset="0x334" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for WDT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI0_CLK_GATE" acronym="MSS_RCM_MCSPI0_CLK_GATE" offset="0x33C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for Corresponding SPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI1_CLK_GATE" acronym="MSS_RCM_MCSPI1_CLK_GATE" offset="0x340" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for Corresponding SPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI2_CLK_GATE" acronym="MSS_RCM_MCSPI2_CLK_GATE" offset="0x344" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for Corresponding SPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI3_CLK_GATE" acronym="MSS_RCM_MCSPI3_CLK_GATE" offset="0x348" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for Corresponding SPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI4_CLK_GATE" acronym="MSS_RCM_MCSPI4_CLK_GATE" offset="0x34C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for Corresponding SPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MMC0_CLK_GATE" acronym="MSS_RCM_MMC0_CLK_GATE" offset="0x350" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for MMCSD" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_ICSSM0_UART_CLK_GATE" acronym="MSS_RCM_ICSSM0_UART_CLK_GATE" offset="0x354" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for ICSSM_UCLK" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_CPTS_CLK_GATE" acronym="MSS_RCM_CPTS_CLK_GATE" offset="0x358" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for CPTS" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_GPMC_CLK_GATE" acronym="MSS_RCM_GPMC_CLK_GATE" offset="0x35C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for GPMC" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_CONTROLSS_PLL_CLK_GATE" acronym="MSS_RCM_CONTROLSS_PLL_CLK_GATE" offset="0x360" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for CONTROLSS_PLL" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_I2C0_CLK_GATE" acronym="MSS_RCM_I2C0_CLK_GATE" offset="0x364" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for I2C" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_I2C1_CLK_GATE" acronym="MSS_RCM_I2C1_CLK_GATE" offset="0x368" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for I2C" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_I2C2_CLK_GATE" acronym="MSS_RCM_I2C2_CLK_GATE" offset="0x36C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for I2C" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_I2C3_CLK_GATE" acronym="MSS_RCM_I2C3_CLK_GATE" offset="0x370" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for I2C" range="2 - 0" rwaccess="RW"/>
	</register>
