IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_LIN0_CLK_GATE" acronym="MSS_RCM_LIN0_CLK_GATE" offset="0x374" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for SPIB" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN1_CLK_GATE" acronym="MSS_RCM_LIN1_CLK_GATE" offset="0x378" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for SPIB" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN2_CLK_GATE" acronym="MSS_RCM_LIN2_CLK_GATE" offset="0x37C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for SPIB" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN3_CLK_GATE" acronym="MSS_RCM_LIN3_CLK_GATE" offset="0x380" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for SPIB" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN4_CLK_GATE" acronym="MSS_RCM_LIN4_CLK_GATE" offset="0x384" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for SPIB" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART0_CLK_GATE" acronym="MSS_RCM_UART0_CLK_GATE" offset="0x38C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for corresponding UART" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART1_CLK_GATE" acronym="MSS_RCM_UART1_CLK_GATE" offset="0x390" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for corresponding UART" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART2_CLK_GATE" acronym="MSS_RCM_UART2_CLK_GATE" offset="0x394" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for corresponding UART" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART3_CLK_GATE" acronym="MSS_RCM_UART3_CLK_GATE" offset="0x398" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for corresponding UART" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART4_CLK_GATE" acronym="MSS_RCM_UART4_CLK_GATE" offset="0x39C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for corresponding UART" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART5_CLK_GATE" acronym="MSS_RCM_UART5_CLK_GATE" offset="0x3A0" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for corresponding UART" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RGMII_250_CLK_GATE" acronym="MSS_RCM_RGMII_250_CLK_GATE" offset="0x3A4" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for RGMII" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RGMII_50_CLK_GATE" acronym="MSS_RCM_RGMII_50_CLK_GATE" offset="0x3A8" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for MII100" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RGMII_5_CLK_GATE" acronym="MSS_RCM_RGMII_5_CLK_GATE" offset="0x3AC" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for MII10" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MMC0_32K_CLK_GATE" acronym="MSS_RCM_MMC0_32K_CLK_GATE" offset="0x3B0" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for MMCSD_32K" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_TEMPSENSE_32K_CLK_GATE" acronym="MSS_RCM_TEMPSENSE_32K_CLK_GATE" offset="0x3B4" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for TEMPSENSE_32K" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_CPSW_CLK_GATE" acronym="MSS_RCM_CPSW_CLK_GATE" offset="0x3B8" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for CPSW CPPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_ICSSM0_IEP_CLK_GATE" acronym="MSS_RCM_ICSSM0_IEP_CLK_GATE" offset="0x3BC" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for ICSSM_IEP" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_ICSSM0_CORE_CLK_GATE" acronym="MSS_RCM_ICSSM0_CORE_CLK_GATE" offset="0x3C0" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for ICSSM_CORE" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MSS_ICSSM_SYS_CLK_GATE" acronym="MSS_RCM_MSS_ICSSM_SYS_CLK_GATE" offset="0x3C4" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for ICSSM_SYS" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MSS_ELM_CLK_GATE" acronym="MSS_RCM_MSS_ELM_CLK_GATE" offset="0x3C8" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for ELM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_CORE0_GATE" acronym="MSS_RCM_R5SS0_CORE0_GATE" offset="0x3CC" width="8" description="">
		<bitfield id="CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock to CORE0 related peripherals inside Cortexr5ss" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_CORE0_GATE" acronym="MSS_RCM_R5SS1_CORE0_GATE" offset="0x3D0" width="8" description="">
		<bitfield id="CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock to CORE0 related peripherals inside Cortexr5ss" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_CORE1_GATE" acronym="MSS_RCM_R5SS0_CORE1_GATE" offset="0x3D4" width="8" description="">
		<bitfield id="CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock to CORE1 related peripherals inside Cortexr5ss" range="2 - 0" rwaccess="RW"/>
	</register>
