IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_R5SS1_CORE1_GATE" acronym="MSS_RCM_R5SS1_CORE1_GATE" offset="0x3D8" width="8" description="">
		<bitfield id="CLKGATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock to CORE1 related peripherals inside Cortexr5ss" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN0_CLK_STATUS" acronym="MSS_RCM_MCAN0_CLK_STATUS" offset="0x400" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_MCAN1_CLK_STATUS" acronym="MSS_RCM_MCAN1_CLK_STATUS" offset="0x404" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_MCAN2_CLK_STATUS" acronym="MSS_RCM_MCAN2_CLK_STATUS" offset="0x408" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_MCAN3_CLK_STATUS" acronym="MSS_RCM_MCAN3_CLK_STATUS" offset="0x40C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for corresponding MCAN" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for corresponding MCAN" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_QSPI0_CLK_STATUS" acronym="MSS_RCM_QSPI0_CLK_STATUS" offset="0x410" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for QSPI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for QSPI" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_RTI0_CLK_STATUS" acronym="MSS_RCM_RTI0_CLK_STATUS" offset="0x414" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_RTI1_CLK_STATUS" acronym="MSS_RCM_RTI1_CLK_STATUS" offset="0x418" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_RTI2_CLK_STATUS" acronym="MSS_RCM_RTI2_CLK_STATUS" offset="0x41C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_RTI3_CLK_STATUS" acronym="MSS_RCM_RTI3_CLK_STATUS" offset="0x420" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding RTI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding RTI" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_WDT0_CLK_STATUS" acronym="MSS_RCM_WDT0_CLK_STATUS" offset="0x428" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for WDT" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for WDT" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_WDT1_CLK_STATUS" acronym="MSS_RCM_WDT1_CLK_STATUS" offset="0x42C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for WDT" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for WDT" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_WDT2_CLK_STATUS" acronym="MSS_RCM_WDT2_CLK_STATUS" offset="0x430" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for WDT" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for WDT" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_WDT3_CLK_STATUS" acronym="MSS_RCM_WDT3_CLK_STATUS" offset="0x434" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for WDT" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for WDT" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_MCSPI0_CLK_STATUS" acronym="MSS_RCM_MCSPI0_CLK_STATUS" offset="0x43C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI" range="7 - 0" rwaccess="RO"/>
	</register>
