IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_MCSPI1_CLK_STATUS" acronym="MSS_RCM_MCSPI1_CLK_STATUS" offset="0x440" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_MCSPI2_CLK_STATUS" acronym="MSS_RCM_MCSPI2_CLK_STATUS" offset="0x444" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_MCSPI3_CLK_STATUS" acronym="MSS_RCM_MCSPI3_CLK_STATUS" offset="0x448" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_MCSPI4_CLK_STATUS" acronym="MSS_RCM_MCSPI4_CLK_STATUS" offset="0x44C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Corresponding SPI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Corresponding SPI" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_MMC0_CLK_STATUS" acronym="MSS_RCM_MMC0_CLK_STATUS" offset="0x450" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for MMCSD" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for MMCSD" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_ICSSM0_UART_CLK_STATUS" acronym="MSS_RCM_ICSSM0_UART_CLK_STATUS" offset="0x454" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for ICSSM_UCLK" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for ICSSM_UCLK" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_CPTS_CLK_STATUS" acronym="MSS_RCM_CPTS_CLK_STATUS" offset="0x458" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CPTS" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CPTS" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_GPMC_CLK_STATUS" acronym="MSS_RCM_GPMC_CLK_STATUS" offset="0x45C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for GPMC" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for GPMC" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_CONTROLSS_PLL_CLK_STATUS" acronym="MSS_RCM_CONTROLSS_PLL_CLK_STATUS" offset="0x460" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CONTROLSS_PLL" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CONTROLSS_PLL" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_I2C_CLK_STATUS" acronym="MSS_RCM_I2C_CLK_STATUS" offset="0x464" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for I2C" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for I2C" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_LIN0_UART0_CLK_STATUS" acronym="MSS_RCM_LIN0_UART0_CLK_STATUS" offset="0x474" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_LIN1_UART1_CLK_STATUS" acronym="MSS_RCM_LIN1_UART1_CLK_STATUS" offset="0x478" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_LIN2_UART2_CLK_STATUS" acronym="MSS_RCM_LIN2_UART2_CLK_STATUS" offset="0x47C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_LIN3_UART3_CLK_STATUS" acronym="MSS_RCM_LIN3_UART3_CLK_STATUS" offset="0x480" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_LIN4_UART4_CLK_STATUS" acronym="MSS_RCM_LIN4_UART4_CLK_STATUS" offset="0x484" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_LIN5_UART5_CLK_STATUS" acronym="MSS_RCM_LIN5_UART5_CLK_STATUS" offset="0x488" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for  corresponding UART and LIN" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for  corresponding UART and LIN" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_RGMII_250_CLK_STATUS" acronym="MSS_RCM_RGMII_250_CLK_STATUS" offset="0x48C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x1" description="Status shows the current divider value choosen for RGMII" range="15 - 8" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_RGMII_50_CLK_STATUS" acronym="MSS_RCM_RGMII_50_CLK_STATUS" offset="0x490" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x9" description="Status shows the current divider value choosen for MII100" range="15 - 8" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_RGMII_5_CLK_STATUS" acronym="MSS_RCM_RGMII_5_CLK_STATUS" offset="0x494" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x99" description="Status shows the current divider value choosen for MII10" range="15 - 8" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_MMC0_32K_CLK_STATUS" acronym="MSS_RCM_MMC0_32K_CLK_STATUS" offset="0x49C" width="24" description="">
		<bitfield id="CURRDIVIDER" width="10" begin="17" end="8" resetval="0x780" description="Status shows the current divider value choosen for XTAL_32K" range="17 - 8" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_TEMPSENSE_32K_CLK_STATUS" acronym="MSS_RCM_TEMPSENSE_32K_CLK_STATUS" offset="0x4A0" width="24" description="">
		<bitfield id="CURRDIVIDER" width="10" begin="17" end="8" resetval="0x780" description="Status shows the current divider value choosen for XTAL_32K" range="17 - 8" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_MSS_ELM_CLK_STATUS" acronym="MSS_RCM_MSS_ELM_CLK_STATUS" offset="0x4A4" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x3" description="Status shows the current divider value choosen for ELM" range="15 - 8" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_R5SS0_POR_RST_CTRL" acronym="MSS_RCM_R5SS0_POR_RST_CTRL" offset="0x500" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:writing '111' will assert por reset to R5SS Read is always 000" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_POR_RST_CTRL" acronym="MSS_RCM_R5SS1_POR_RST_CTRL" offset="0x504" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:writing '111' will assert por reset to R5SS Read is always 000" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_CORE0_GRST_CTRL" acronym="MSS_RCM_R5SS0_CORE0_GRST_CTRL" offset="0x508" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:writing '111'  will reset CORE0 and MSS_CORE0_VIM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_CORE0_GRST_CTRL" acronym="MSS_RCM_R5SS1_CORE0_GRST_CTRL" offset="0x50C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:writing '111'  will reset CORE0 and MSS_CORE0_VIM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_CORE1_GRST_CTRL" acronym="MSS_RCM_R5SS0_CORE1_GRST_CTRL" offset="0x510" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:writing '111'  will reset CORE1  and MSS_CORE1_VIM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_CORE1_GRST_CTRL" acronym="MSS_RCM_R5SS1_CORE1_GRST_CTRL" offset="0x514" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:writing '111'  will reset CORE1  and MSS_CORE1_VIM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_CORE0_LRST_CTRL" acronym="MSS_RCM_R5SS0_CORE0_LRST_CTRL" offset="0x518" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:writing '111'  will reset CORE0 only" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_CORE0_LRST_CTRL" acronym="MSS_RCM_R5SS1_CORE0_LRST_CTRL" offset="0x51C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:writing '111'  will reset CORE0 only" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_CORE1_LRST_CTRL" acronym="MSS_RCM_R5SS0_CORE1_LRST_CTRL" offset="0x520" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:writing '111'  will reset CORE1 only" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_CORE1_LRST_CTRL" acronym="MSS_RCM_R5SS1_CORE1_LRST_CTRL" offset="0x524" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring.write pulse bit field:writing '111'  will reset CORE1 only" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_VIM0_RST_CTRL" acronym="MSS_RCM_R5SS0_VIM0_RST_CTRL" offset="0x528" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MSS_CORE0_VIM Writing 000 will deassert the reset" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_VIM0_RST_CTRL" acronym="MSS_RCM_R5SS1_VIM0_RST_CTRL" offset="0x52C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MSS_CORE0_VIM Writing 000 will deassert the reset" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS0_VIM1_RST_CTRL" acronym="MSS_RCM_R5SS0_VIM1_RST_CTRL" offset="0x530" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MSS_CORE1_VIM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_R5SS1_VIM1_RST_CTRL" acronym="MSS_RCM_R5SS1_VIM1_RST_CTRL" offset="0x534" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MSS_CORE1_VIM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCRC0_RST_CTRL" acronym="MSS_RCM_MCRC0_RST_CTRL" offset="0x538" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MCRC" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI0_RST_CTRL" acronym="MSS_RCM_RTI0_RST_CTRL" offset="0x53C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding RTI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI1_RST_CTRL" acronym="MSS_RCM_RTI1_RST_CTRL" offset="0x540" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding RTI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI2_RST_CTRL" acronym="MSS_RCM_RTI2_RST_CTRL" offset="0x544" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding RTI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_RTI3_RST_CTRL" acronym="MSS_RCM_RTI3_RST_CTRL" offset="0x548" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding RTI" range="2 - 0" rwaccess="RW"/>
	</register>
