IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_WDT0_RST_CTRL" acronym="MSS_RCM_WDT0_RST_CTRL" offset="0x54C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset WDT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT1_RST_CTRL" acronym="MSS_RCM_WDT1_RST_CTRL" offset="0x550" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset WDT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT2_RST_CTRL" acronym="MSS_RCM_WDT2_RST_CTRL" offset="0x554" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset WDT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_WDT3_RST_CTRL" acronym="MSS_RCM_WDT3_RST_CTRL" offset="0x558" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset WDT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_TOP_ESM_RST_CTRL" acronym="MSS_RCM_TOP_ESM_RST_CTRL" offset="0x55C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset ESM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_DCC0_RST_CTRL" acronym="MSS_RCM_DCC0_RST_CTRL" offset="0x560" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset DCCA" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_DCC1_RST_CTRL" acronym="MSS_RCM_DCC1_RST_CTRL" offset="0x564" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset DCCB" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_DCC2_RST_CTRL" acronym="MSS_RCM_DCC2_RST_CTRL" offset="0x568" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset DCCC" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_DCC3_RST_CTRL" acronym="MSS_RCM_DCC3_RST_CTRL" offset="0x56C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset DCCD" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI0_RST_CTRL" acronym="MSS_RCM_MCSPI0_RST_CTRL" offset="0x570" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset Corresponding SPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI1_RST_CTRL" acronym="MSS_RCM_MCSPI1_RST_CTRL" offset="0x574" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset Corresponding SPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI2_RST_CTRL" acronym="MSS_RCM_MCSPI2_RST_CTRL" offset="0x578" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset Corresponding SPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI3_RST_CTRL" acronym="MSS_RCM_MCSPI3_RST_CTRL" offset="0x57C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset Corresponding SPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCSPI4_RST_CTRL" acronym="MSS_RCM_MCSPI4_RST_CTRL" offset="0x580" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset Corresponding SPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_QSPI0_RST_CTRL" acronym="MSS_RCM_QSPI0_RST_CTRL" offset="0x584" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset QSPI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN0_RST_CTRL" acronym="MSS_RCM_MCAN0_RST_CTRL" offset="0x588" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding MCAN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN1_RST_CTRL" acronym="MSS_RCM_MCAN1_RST_CTRL" offset="0x58C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding MCAN" range="2 - 0" rwaccess="RW"/>
	</register>
