IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_MCAN2_RST_CTRL" acronym="MSS_RCM_MCAN2_RST_CTRL" offset="0x590" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding MCAN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MCAN3_RST_CTRL" acronym="MSS_RCM_MCAN3_RST_CTRL" offset="0x594" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding MCAN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_I2C0_RST_CTRL" acronym="MSS_RCM_I2C0_RST_CTRL" offset="0x598" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding I2C" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_I2C1_RST_CTRL" acronym="MSS_RCM_I2C1_RST_CTRL" offset="0x59C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding I2C" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_I2C2_RST_CTRL" acronym="MSS_RCM_I2C2_RST_CTRL" offset="0x5A0" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding I2C" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_I2C3_RST_CTRL" acronym="MSS_RCM_I2C3_RST_CTRL" offset="0x5A4" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding I2C" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART0_RST_CTRL" acronym="MSS_RCM_UART0_RST_CTRL" offset="0x5A8" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding UART instance" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART1_RST_CTRL" acronym="MSS_RCM_UART1_RST_CTRL" offset="0x5AC" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding UART instance" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART2_RST_CTRL" acronym="MSS_RCM_UART2_RST_CTRL" offset="0x5B0" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding UART instance" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART3_RST_CTRL" acronym="MSS_RCM_UART3_RST_CTRL" offset="0x5B4" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding UART instance" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART4_RST_CTRL" acronym="MSS_RCM_UART4_RST_CTRL" offset="0x5B8" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding UART instance" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_UART5_RST_CTRL" acronym="MSS_RCM_UART5_RST_CTRL" offset="0x5BC" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding UART instance" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN0_RST_CTRL" acronym="MSS_RCM_LIN0_RST_CTRL" offset="0x5C0" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset LIN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN1_RST_CTRL" acronym="MSS_RCM_LIN1_RST_CTRL" offset="0x5C4" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset LIN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN2_RST_CTRL" acronym="MSS_RCM_LIN2_RST_CTRL" offset="0x5C8" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset LIN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN3_RST_CTRL" acronym="MSS_RCM_LIN3_RST_CTRL" offset="0x5CC" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset LIN" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LIN4_RST_CTRL" acronym="MSS_RCM_LIN4_RST_CTRL" offset="0x5D0" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset LIN" range="2 - 0" rwaccess="RW"/>
	</register>
