IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_EDMA_RST_CTRL" acronym="MSS_RCM_EDMA_RST_CTRL" offset="0x5D8" width="16" description="">
		<bitfield id="TPTCA1_ASSERT" width="3" begin="14" end="12" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MSS_TPTCA1" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="TPTCA0_ASSERT" width="3" begin="10" end="8" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MSS_TPTCA0" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="TPCCA_ASSERT" width="3" begin="6" end="4" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MSS_TPCCA" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset EDMA" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_INFRA_RST_CTRL" acronym="MSS_RCM_INFRA_RST_CTRL" offset="0x5DC" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MSS INFRA" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_CPSW_RST_CTRL" acronym="MSS_RCM_CPSW_RST_CTRL" offset="0x5E0" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MSS CPSW" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_ICSSM0_RST_CTRL" acronym="MSS_RCM_ICSSM0_RST_CTRL" offset="0x5E4" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MSS ICSSM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MMC0_RST_CTRL" acronym="MSS_RCM_MMC0_RST_CTRL" offset="0x5E8" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset MMCSD" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_GPIO0_RST_CTRL" acronym="MSS_RCM_GPIO0_RST_CTRL" offset="0x5EC" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding GPIO" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_GPIO1_RST_CTRL" acronym="MSS_RCM_GPIO1_RST_CTRL" offset="0x5F0" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding GPIO" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_GPIO2_RST_CTRL" acronym="MSS_RCM_GPIO2_RST_CTRL" offset="0x5F4" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding GPIO" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_GPIO3_RST_CTRL" acronym="MSS_RCM_GPIO3_RST_CTRL" offset="0x5F8" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset corresponding GPIO" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_SPINLOCK0_RST_CTRL" acronym="MSS_RCM_SPINLOCK0_RST_CTRL" offset="0x5FC" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset SPINLOCK" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_GPMC_RST_CTRL" acronym="MSS_RCM_GPMC_RST_CTRL" offset="0x600" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset GPMC" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_TEMPSENSE_32K_RST_CTRL" acronym="MSS_RCM_TEMPSENSE_32K_RST_CTRL" offset="0x604" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset TEMPSENSE" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_MSS_ELM_RST_CTRL" acronym="MSS_RCM_MSS_ELM_RST_CTRL" offset="0x608" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="This feature is for debug purpose only. Software needs to ensure the state of the Device/IP before configuring. Writing  '111'  will reset ELM" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_L2OCRAM_BANK0_PD_CTRL" acronym="MSS_RCM_L2OCRAM_BANK0_PD_CTRL" offset="0x700" width="16" description="">
		<bitfield id="AGOODIN" width="3" begin="10" end="8" resetval="0x7" description="SW control for power signal 'AGOODIN' for MSS_L2_BANKA" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="AONIN" width="3" begin="6" end="4" resetval="0x7" description="SW control for power signal 'AONIN' for MSS_L2_BANKA" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="ISO" width="3" begin="2" end="0" resetval="0x0" description="SW control for power signal 'ISO' for MSS_L2_BANKA" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_L2OCRAM_BANK1_PD_CTRL" acronym="MSS_RCM_L2OCRAM_BANK1_PD_CTRL" offset="0x704" width="16" description="">
		<bitfield id="AGOODIN" width="3" begin="10" end="8" resetval="0x7" description="SW control for power signal 'AGOODIN' for MSS_L2_BANKB" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="AONIN" width="3" begin="6" end="4" resetval="0x7" description="SW control for power signal 'AONIN' for MSS_L2_BANKB" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="ISO" width="3" begin="2" end="0" resetval="0x0" description="SW control for power signal 'ISO' for MSS_L2_BANKB" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_L2OCRAM_BANK2_PD_CTRL" acronym="MSS_RCM_L2OCRAM_BANK2_PD_CTRL" offset="0x708" width="16" description="">
		<bitfield id="AGOODIN" width="3" begin="10" end="8" resetval="0x7" description="SW control for power signal 'AGOODIN' for MSS_L2_BANKC" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="AONIN" width="3" begin="6" end="4" resetval="0x7" description="SW control for power signal 'AONIN' for MSS_L2_BANKC" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="ISO" width="3" begin="2" end="0" resetval="0x0" description="SW control for power signal 'ISO' for MSS_L2_BANKC" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_L2OCRAM_BANK3_PD_CTRL" acronym="MSS_RCM_L2OCRAM_BANK3_PD_CTRL" offset="0x70C" width="16" description="">
		<bitfield id="AGOODIN" width="3" begin="10" end="8" resetval="0x7" description="SW control for power signal 'AGOODIN' for MSS_L2_BANKD" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="AONIN" width="3" begin="6" end="4" resetval="0x7" description="SW control for power signal 'AONIN' for MSS_L2_BANKD" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="ISO" width="3" begin="2" end="0" resetval="0x0" description="SW control for power signal 'ISO' for MSS_L2_BANKD" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_L2OCRAM_BANK0_PD_STATUS" acronym="MSS_RCM_L2OCRAM_BANK0_PD_STATUS" offset="0x710" width="8" description="">
		<bitfield id="AGOODOUT" width="1" begin="1" end="1" resetval="0x1" description="SW status indicating the 'pgoodin' of MSS_L2_BANKA" range="1" rwaccess="RO"/> 
		<bitfield id="AONOUT" width="1" begin="0" end="0" resetval="0x1" description="SW status indicating the 'ponin' of MSS_L2_BANKA" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_L2OCRAM_BANK1_PD_STATUS" acronym="MSS_RCM_L2OCRAM_BANK1_PD_STATUS" offset="0x714" width="8" description="">
		<bitfield id="AGOODOUT" width="1" begin="1" end="1" resetval="0x1" description="SW status indicating the 'pgoodin' of MSS_L2_BANKB" range="1" rwaccess="RO"/> 
		<bitfield id="AONOUT" width="1" begin="0" end="0" resetval="0x1" description="SW status indicating the 'ponin' of MSS_L2_BANKB" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_L2OCRAM_BANK2_PD_STATUS" acronym="MSS_RCM_L2OCRAM_BANK2_PD_STATUS" offset="0x718" width="8" description="">
		<bitfield id="AGOODOUT" width="1" begin="1" end="1" resetval="0x1" description="SW status indicating the 'pgoodin' of MSS_L2_BANKC" range="1" rwaccess="RO"/> 
		<bitfield id="AONOUT" width="1" begin="0" end="0" resetval="0x1" description="SW status indicating the 'ponin' of MSS_L2_BANKC" range="0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_L2OCRAM_BANK3_PD_STATUS" acronym="MSS_RCM_L2OCRAM_BANK3_PD_STATUS" offset="0x71C" width="8" description="">
		<bitfield id="AGOODOUT" width="1" begin="1" end="1" resetval="0x1" description="SW status indicating the 'pgoodin' of MSS_L2_BANKD" range="1" rwaccess="RO"/> 
		<bitfield id="AONOUT" width="1" begin="0" end="0" resetval="0x1" description="SW status indicating the 'ponin' of MSS_L2_BANKD" range="0" rwaccess="RO"/>
	</register>
