IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_HW_REG0" acronym="MSS_RCM_HW_REG0" offset="0x720" width="32" description="">
		<bitfield id="HWREG" width="32" begin="31" end="0" resetval="0x0" description="HW Reserved regiser" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HW_REG1" acronym="MSS_RCM_HW_REG1" offset="0x724" width="32" description="">
		<bitfield id="HWREG" width="32" begin="31" end="0" resetval="0x0" description="HW Reserved regiser" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HW_REG2" acronym="MSS_RCM_HW_REG2" offset="0x728" width="32" description="">
		<bitfield id="HWREG" width="32" begin="31" end="0" resetval="0x0" description="HW Reserved regiser" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HW_REG3" acronym="MSS_RCM_HW_REG3" offset="0x72C" width="32" description="">
		<bitfield id="HWREG" width="32" begin="31" end="0" resetval="0x0" description="HW Reserved regiser" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_RTIA_CLK_SRC_SEL" acronym="MSS_RCM_HSM_RTIA_CLK_SRC_SEL" offset="0x800" width="16" description="">
		<bitfield id="HSM_RTI0_CLK_SRC_SEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for HSM_Corresponding RTI.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_WDT_CLK_SRC_SEL" acronym="MSS_RCM_HSM_WDT_CLK_SRC_SEL" offset="0x804" width="16" description="">
		<bitfield id="HSM_WDT0_CLK_SRC_SEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for HSM_WDT.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_RTC_CLK_SRC_SEL" acronym="MSS_RCM_HSM_RTC_CLK_SRC_SEL" offset="0x808" width="16" description="">
		<bitfield id="HSM_RTC0_CLK_SRC_SEL" width="12" begin="11" end="0" resetval="0x1911" description="Select line for selecting source clock for HSM_RTC.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_DMTA_CLK_SRC_SEL" acronym="MSS_RCM_HSM_DMTA_CLK_SRC_SEL" offset="0x80C" width="16" description="">
		<bitfield id="HSM_DTM0_CLK_SRC_SEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for HSM_DMTA.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_DMTB_CLK_SRC_SEL" acronym="MSS_RCM_HSM_DMTB_CLK_SRC_SEL" offset="0x810" width="16" description="">
		<bitfield id="HSM_DTM1_CLK_SRC_SEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for HSM_DMTB.Data should be loaded as multibit.  For example: if '0x5' should be selected then '0x555' should be       configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_RTI_CLK_DIV_VAL" acronym="MSS_RCM_HSM_RTI_CLK_DIV_VAL" offset="0x814" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value HSM RTI selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_WDT_CLK_DIV_VAL" acronym="MSS_RCM_HSM_WDT_CLK_DIV_VAL" offset="0x818" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value HSM WDT selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_RTC_CLK_DIV_VAL" acronym="MSS_RCM_HSM_RTC_CLK_DIV_VAL" offset="0x81C" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value HSM RTC selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_DMTA_CLK_DIV_VAL" acronym="MSS_RCM_HSM_DMTA_CLK_DIV_VAL" offset="0x820" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value HSM DMTA selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_DMTB_CLK_DIV_VAL" acronym="MSS_RCM_HSM_DMTB_CLK_DIV_VAL" offset="0x824" width="16" description="">
		<bitfield id="CLKDIVR" width="12" begin="11" end="0" resetval="0x0" description="Divider value HSM DMTB selected clock.Data should be loaded as multibit.  For example: if divider value of '0x8' should be selected then '0x888' should be configured to the register.Refer to AM602 clock spec for clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_RTI_CLK_GATE" acronym="MSS_RCM_HSM_RTI_CLK_GATE" offset="0x828" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for HSM RTI" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_WDT_CLK_GATE" acronym="MSS_RCM_HSM_WDT_CLK_GATE" offset="0x82C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for HSM WDT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_RTC_CLK_GATE" acronym="MSS_RCM_HSM_RTC_CLK_GATE" offset="0x830" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for HSM RTC" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_DMTA_CLK_GATE" acronym="MSS_RCM_HSM_DMTA_CLK_GATE" offset="0x834" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for HSM DMTA" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_DMTB_CLK_GATE" acronym="MSS_RCM_HSM_DMTB_CLK_GATE" offset="0x838" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="writing '111'  will gate clock for HSM DMTB" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HSM_RTI_CLK_STATUS" acronym="MSS_RCM_HSM_RTI_CLK_STATUS" offset="0x83C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for HSM_RTI" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for HSM_RTI" range="7 - 0" rwaccess="RO"/>
	</register>
