IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MSS_RCM_MSS_RCM.xml
	<register id="MSS_RCM_HSM_WDT_CLK_STATUS" acronym="MSS_RCM_HSM_WDT_CLK_STATUS" offset="0x840" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for HSM_WDT" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for HSM_WDT" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_HSM_RTC_CLK_STATUS" acronym="MSS_RCM_HSM_RTC_CLK_STATUS" offset="0x844" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for HSM_RTC" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x128" description="Status shows the source clock slected for HSM_RTC" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_HSM_DMTA_CLK_STATUS" acronym="MSS_RCM_HSM_DMTA_CLK_STATUS" offset="0x848" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for HSM_DMTA" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for HSM_DMTA" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_HSM_DMTB_CLK_STATUS" acronym="MSS_RCM_HSM_DMTB_CLK_STATUS" offset="0x84C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for HSM_DMTB" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for HSM_DMTB" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_HW_SPARE_RW0" acronym="MSS_RCM_HW_SPARE_RW0" offset="0xFD0" width="32" description="">
		<bitfield id="HW_SPARE_RW0" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HW_SPARE_RW1" acronym="MSS_RCM_HW_SPARE_RW1" offset="0xFD4" width="32" description="">
		<bitfield id="HW_SPARE_RW1" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HW_SPARE_RW2" acronym="MSS_RCM_HW_SPARE_RW2" offset="0xFD8" width="32" description="">
		<bitfield id="HW_SPARE_RW2" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HW_SPARE_RW3" acronym="MSS_RCM_HW_SPARE_RW3" offset="0xFDC" width="32" description="">
		<bitfield id="HW_SPARE_RW3" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HW_SPARE_RO0" acronym="MSS_RCM_HW_SPARE_RO0" offset="0xFE0" width="32" description="">
		<bitfield id="HW_SPARE_RO0" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_HW_SPARE_RO1" acronym="MSS_RCM_HW_SPARE_RO1" offset="0xFE4" width="32" description="">
		<bitfield id="HW_SPARE_RO1" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_HW_SPARE_RO2" acronym="MSS_RCM_HW_SPARE_RO2" offset="0xFE8" width="32" description="">
		<bitfield id="HW_SPARE_RO2" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_HW_SPARE_RO3" acronym="MSS_RCM_HW_SPARE_RO3" offset="0xFEC" width="32" description="">
		<bitfield id="HW_SPARE_RO3" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MSS_RCM_HW_SPARE_WPH" acronym="MSS_RCM_HW_SPARE_WPH" offset="0xFF0" width="32" description="">
		<bitfield id="HW_SPARE_WPH" width="32" begin="31" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_HW_SPARE_REC" acronym="MSS_RCM_HW_SPARE_REC" offset="0xFF4" width="32" description="">
		<bitfield id="HW_SPARE_REC31" width="1" begin="31" end="31" resetval="0x0" description="Reserved for HW R&#38;D" range="31" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC30" width="1" begin="30" end="30" resetval="0x0" description="Reserved for HW R&#38;D" range="30" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC29" width="1" begin="29" end="29" resetval="0x0" description="Reserved for HW R&#38;D" range="29" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC28" width="1" begin="28" end="28" resetval="0x0" description="Reserved for HW R&#38;D" range="28" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC27" width="1" begin="27" end="27" resetval="0x0" description="Reserved for HW R&#38;D" range="27" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC26" width="1" begin="26" end="26" resetval="0x0" description="Reserved for HW R&#38;D" range="26" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC25" width="1" begin="25" end="25" resetval="0x0" description="Reserved for HW R&#38;D" range="25" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC24" width="1" begin="24" end="24" resetval="0x0" description="Reserved for HW R&#38;D" range="24" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC23" width="1" begin="23" end="23" resetval="0x0" description="Reserved for HW R&#38;D" range="23" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC22" width="1" begin="22" end="22" resetval="0x0" description="Reserved for HW R&#38;D" range="22" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC21" width="1" begin="21" end="21" resetval="0x0" description="Reserved for HW R&#38;D" range="21" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC20" width="1" begin="20" end="20" resetval="0x0" description="Reserved for HW R&#38;D" range="20" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC19" width="1" begin="19" end="19" resetval="0x0" description="Reserved for HW R&#38;D" range="19" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC18" width="1" begin="18" end="18" resetval="0x0" description="Reserved for HW R&#38;D" range="18" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC17" width="1" begin="17" end="17" resetval="0x0" description="Reserved for HW R&#38;D" range="17" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC16" width="1" begin="16" end="16" resetval="0x0" description="Reserved for HW R&#38;D" range="16" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC15" width="1" begin="15" end="15" resetval="0x0" description="Reserved for HW R&#38;D" range="15" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC14" width="1" begin="14" end="14" resetval="0x0" description="Reserved for HW R&#38;D" range="14" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC13" width="1" begin="13" end="13" resetval="0x0" description="Reserved for HW R&#38;D" range="13" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC12" width="1" begin="12" end="12" resetval="0x0" description="Reserved for HW R&#38;D" range="12" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC11" width="1" begin="11" end="11" resetval="0x0" description="Reserved for HW R&#38;D" range="11" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC10" width="1" begin="10" end="10" resetval="0x0" description="Reserved for HW R&#38;D" range="10" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC9" width="1" begin="9" end="9" resetval="0x0" description="Reserved for HW R&#38;D" range="9" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC8" width="1" begin="8" end="8" resetval="0x0" description="Reserved for HW R&#38;D" range="8" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC7" width="1" begin="7" end="7" resetval="0x0" description="Reserved for HW R&#38;D" range="7" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC6" width="1" begin="6" end="6" resetval="0x0" description="Reserved for HW R&#38;D" range="6" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC5" width="1" begin="5" end="5" resetval="0x0" description="Reserved for HW R&#38;D" range="5" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC4" width="1" begin="4" end="4" resetval="0x0" description="Reserved for HW R&#38;D" range="4" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC3" width="1" begin="3" end="3" resetval="0x0" description="Reserved for HW R&#38;D" range="3" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC2" width="1" begin="2" end="2" resetval="0x0" description="Reserved for HW R&#38;D" range="2" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC1" width="1" begin="1" end="1" resetval="0x0" description="Reserved for HW R&#38;D" range="1" rwaccess="RW"/> 
		<bitfield id="HW_SPARE_REC0" width="1" begin="0" end="0" resetval="0x0" description="Reserved for HW R&#38;D" range="0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LOCK0_KICK0" acronym="MSS_RCM_LOCK0_KICK0" offset="0x1008" width="32" description="">
		<bitfield id="LOCK0_KICK0" width="32" begin="31" end="0" resetval="0x0" description="- KICK0 component" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_LOCK0_KICK1" acronym="MSS_RCM_LOCK0_KICK1" offset="0x100C" width="32" description="">
		<bitfield id="LOCK0_KICK1" width="32" begin="31" end="0" resetval="0x0" description="- KICK1 component" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="MSS_RCM_INTR_RAW_STATUS" acronym="MSS_RCM_INTR_RAW_STATUS" offset="0x1010" width="8" description="">
		<bitfield id="PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="3" rwaccess="RW"/> 
		<bitfield id="KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="2" rwaccess="RW"/> 
		<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="RW"/> 
		<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="RW"/>
	</register>
